/*
На сцене находится несколько кубов. При нажатии на куб он исчезает и появляются новые кубы, в случайном количестве от 2 до 6 штук.
У каждого нового куба Scale уменьшен в два раза по всем осям относительно того куба, на который нажал пользователь.
Цвет каждого куба определяется случайным образом.
На каждый куб действует сила гравитации.
Шанс разделения с каждым разом уменьшается в 2 раза начиная со 100%. При успехе идет разделение, иначе куб просто исчезает.
Добавить взрывную силу из центра исчезнувшего куба, которая разбросает только созданные им объекты.
Сделать невидимые ограждения, чтобы кубики далеко не разлетались.
------------------------------------------------------------------------------------------------------------------------------------------
ToDo:
- Создать комнату:
    - Стены
    - Пол
- Создать куб:
    - Шанс появления кубов (шанс спавна, макс кубов, мин кубов)
    - partic... system
    - Выключать отображение куба перед созданием дочернего обьекта
    - размер доп кубов меньше, они в области родителя
    - эффект взрыва при нажатии на куб
 */